# SQL Project
You were hired by Ironhack to perform an Analytics Consulting Project entitled: competitive landscape.

Your mission is to create and populate an appropriate database with many coding schools that are our competition, as well as design an suitable queries that answer business questions of interest (to be defined by you)

**Suggested Steps in the Project:**


*   Read this notebook and understand each function. Comment the code appropriately

*   Populate the list of schools with a wider variety of schools (how are you going to get the school ID?)

* Take a look at the obtained dataframes. What dimensions do you have? what keys do you have? how could the different dataframes be connected?

* Go back to the drawing board and try to create an entity relationship diagram for tables available

* Once you have the schemas you want, you will need to:
  - create the suitable SQL queries to create the tables and populate them
  - run these queries using the appropriate Python connectors
  
* Bonus: How will this datamodel be updated in the future? Please write auxiliary functions that test the database for data quality issues. For example: how could you make sure you only include the most recent comments when you re-run the script?


# Suggested Deliverables

* 5-6 minute presentation of data model created, decision process and business analysis proposed

* exported .sql file with the final schema

* Supporting python files used to generate all logic

* High level documentation explaining tables designed and focusing on update methods

Crucial hint: check out the following tutorial:
https://www.dataquest.io/blog/sql-insert-tutorial/

In [9]:
# you must populate this dict with the schools required -> try talking to the teaching team about this

# To get the School ID, we went to the reviews list of the school, then using INSPECTOR tool, we looked at
# the network request that is being made when you press the pagination buttons at the end of the review list.
# The URL used to fetch data there has school name and ID as parameter

schools = {   
    'ironhack' : 10828,
    'app-academy' : 10525,
    'springboard' : 11035,
    'actualize': 10505,
    'learningfuze': 10862,
    'clarusway': 11539,
    'codesmith':10643,
    'code-platoon':10627,
    'knowledgehut':10846,
    'udacity':11118,
    'altcademy':10517,
    'tech-elevator':11056,
    'codeworks': 10650,
    '4geeks-academy': 10492,
    'coding-temple': 10664,
    'devcodecamp': 10703,
    'nucamp': 10923,
    'tripleten': 11225,
    'skillcrush':11020,
    'the-tech-academy': 11091,
    'hack-reactor': 10788,
    'tech-i-s': 11283,
    'brainstation': 10571,
    'coding-dojo': 10659
}

In [11]:
import re
import pandas as pd
from pandas.io.json import json_normalize
import requests



def get_comments_school(school):
    print(school)
    TAG_RE = re.compile(r'<[^>]+>')
    # defines url to make api call to data -> dynamic with school if you want to scrape competition
    url = "https://www.switchup.org/chimera/v1/school-review-list?mainTemplate=school-review-list&path=%2Fbootcamps%2F" + school + "&isDataTarget=false&page=3&perPage=10000&simpleHtml=true&truncationLength=250"
    #makes get request and converts answer to json
    # url defines the page of all the information, request is made, and information is returned to data variable
    data = requests.get(url).json()
    #converts json to dataframe
    reviews =  pd.DataFrame(data['content']['reviews'])
  
    #aux function to apply regex and remove tags
    def remove_tags(x):
        return TAG_RE.sub('',x)
    reviews['review_body'] = reviews['body'].apply(remove_tags)
    reviews['school'] = school
    return reviews

In [12]:
# could you write this as a list comprehension? ;)
comments =pd.concat([get_comments_school(school) for school in schools.keys()])

ironhack
app-academy
springboard
actualize
learningfuze
clarusway
codesmith
code-platoon
knowledgehut
udacity
altcademy
tech-elevator
codeworks
4geeks-academy
coding-temple
devcodecamp
nucamp
tripleten
skillcrush
the-tech-academy
hack-reactor
tech-i-s
brainstation
coding-dojo

In [15]:
comments.info()
comments.to_csv('comments.csv')

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10716 entries, 0 to 489
Data columns (total 21 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               10716 non-null  int64
 1   name             10716 non-null  object
 2   anonymous        10716 non-null  bool
 3   hostProgramName  3999 non-null   object
 4   graduatingYear   10663 non-null  float64
 5   isAlumni         10715 non-null  object
 6   jobTitle         6624 non-null   object
 7   tagline          10715 non-null  object
 8   body             10716 non-null  object
 9   rawBody          10716 non-null  object
 10  createdAt        10716 non-null  object
 11  queryDate        10716 non-null  object
 12  program          9396 non-null   object
 13  user             10716 non-null  object
 14  overallScore     10703 non-null  object
 15  comments         10716 non-null  object
 16  overall          10701 non-null  object
 17  curriculum       10464 non-null  object
 18  jobSupport       9539 non-null   object
 19  review_body      10716 non-null  object
 20  school           10716 non-null  object
dtypes: bool(1), float64(1), int64(1), object(18)
memory usage: 1.7+ MB

In [17]:
from pandas import json_normalize

def get_school_info(school, school_id):
    url = 'https://www.switchup.org/chimera/v1/bootcamp-data?mainTemplate=bootcamp-data%2Fdescription&path=%2Fbootcamps%2F'+ str(school) + '&isDataTarget=false&bootcampId='+ str(school_id) + '&logoTag=logo&truncationLength=250&readMoreOmission=...&readMoreText=Read%20More&readLessText=Read%20Less'

    data = requests.get(url).json()

    data.keys()

    courses = data['content']['courses']
    courses_df = pd.DataFrame(courses, columns= ['courses'])

    locations = data['content']['locations']
    locations_df = json_normalize(locations)

    badges_df = pd.DataFrame(data['content']['meritBadges'])
    
    website = data['content']['webaddr']
    description = data['content']['description']
    logoUrl = data['content']['logoUrl']
    school_df = pd.DataFrame([website,description,logoUrl]).T
    school_df.columns =  ['website','description','LogoUrl']

    locations_df['school'] = school
    courses_df['school'] = school
    badges_df['school'] = school
    school_df['school'] = school
    

    locations_df['school_id'] = school_id
    courses_df['school_id'] = school_id
    badges_df['school_id'] = school_id
    school_df['school_id'] = school_id

    return locations_df, courses_df, badges_df, school_df

locations_list = []
courses_list = []
badges_list = []
schools_list = []

for school, id in schools.items():
    print(school)
    a,b,c,d = get_school_info(school,id)
    
    locations_list.append(a)
    courses_list.append(b)
    badges_list.append(c)
    schools_list.append(d)

ironhack
app-academy
springboard
actualize
learningfuze
clarusway
codesmith
code-platoon
knowledgehut
udacity
altcademy
tech-elevator
codeworks
4geeks-academy
coding-temple
devcodecamp
nucamp
tripleten
skillcrush
the-tech-academy
hack-reactor
tech-i-s
brainstation
coding-dojo

In [18]:
locations_list

[      id               description  country.id   country.name country.abbrev  \
 0  15901           Berlin, Germany        57.0        Germany             DE
 1  16022       Mexico City, Mexico        29.0         Mexico             MX
 2  16086    Amsterdam, Netherlands        59.0    Netherlands             NL
 3  16088         Sao Paulo, Brazil        42.0         Brazil             BR
 4  16109             Paris, France        38.0         France             FR
 5  16375  Miami, FL, United States         1.0  United States             US
 6  16376             Madrid, Spain        12.0          Spain             ES
 7  16377          Barcelona, Spain        12.0          Spain             ES
 8  16709          Lisbon, Portugal        28.0       Portugal             PT
 9  17233                    Online         NaN            NaN            NaN

    city.id    city.name city.keyword  state.id state.name state.abbrev  \
 0  31156.0       Berlin       berlin       NaN        NaN          NaN
 1  31175.0  Mexico City  mexico-city       NaN        NaN          NaN
 2  31168.0    Amsterdam    amsterdam       NaN        NaN          NaN
 3  31121.0    Sao Paulo    sao-paulo       NaN        NaN          NaN
 4  31136.0        Paris        paris       NaN        NaN          NaN
 5     31.0        Miami        miami      11.0    Florida           FL
 6  31052.0       Madrid       madrid       NaN        NaN          NaN
 7  31170.0    Barcelona    barcelona       NaN        NaN          NaN
 8  31075.0       Lisbon       lisbon       NaN        NaN          NaN
 9      NaN          NaN          NaN       1.0     Online       Online

   state.keyword    school  school_id
 0           NaN  ironhack      10828
 1           NaN  ironhack      10828
 2           NaN  ironhack      10828
 3           NaN  ironhack      10828
 4           NaN  ironhack      10828
 5       florida  ironhack      10828
 6           NaN  ironhack      10828
 7           NaN  ironhack      10828
 8           NaN  ironhack      10828
 9        online  ironhack      10828  ,
       id                       description  country.id   country.name  \
 0  15704  San Francisco, CA, United States         1.0  United States
 1  15705  New York City, NY, United States         1.0  United States
 2  15862                            Online         NaN            NaN

   country.abbrev  state.id  state.name state.abbrev state.keyword  city.id  \
 0             US         6  California           CA    california     13.0
 1             US        34    New York           NY      new-york   1507.0
 2            NaN         1      Online       Online        online      NaN

        city.name   city.keyword       school  school_id
 0  San Francisco  san-francisco  app-academy      10525
 1            NYC  new-york-city  app-academy      10525
 2            NaN            NaN  app-academy      10525  ,
       id description  state.id state.name state.abbrev state.keyword  \
 0  16013      Online         1     Online       Online        online

         school  school_id
 0  springboard      11035  ,
       id                 description  country.id   country.name  \
 0  15703  Chicago, IL, United States         1.0  United States
 1  16019                      Online         NaN            NaN

   country.abbrev  state.id state.name state.abbrev state.keyword  city.id  \
 0             US        15   Illinois           IL      illinois     39.0
 1            NaN         1     Online       Online        online      NaN

   city.name city.keyword     school  school_id
 0   Chicago      chicago  actualize      10505
 1       NaN          NaN  actualize      10505  ,
       id                   description  country.id   country.name  \
 0  16712     Irvine, CA, United States         1.0  United States
 1  16806  San Diego, CA, United States         1.0  United States
 2  16970                        Online         NaN            NaN

   country.abbrev  state.id  state.name state.abbrev state.keyword  city.id  \
 0             US         6  California           CA    california     24.0
 1             US         6  California           CA    california     11.0
 2            NaN         1      Online       Online        online      NaN

    city.name city.keyword        school  school_id
 0     Irvine       irvine  learningfuze      10862
 1  San Diego    san-diego  learningfuze      10862
 2        NaN          NaN  learningfuze      10862  ,
       id description  state.id state.name state.abbrev state.keyword  \
 0  17789      Online         1     Online       Online        online

       school  school_id
 0  clarusway      11539  ,
       id                       description  country.id   country.name  \
 0  16002    Los Angeles, CA, United States         1.0  United States
 1  16328  New York City, NY, United States         1.0  United States
 2  16595                            Online         NaN            NaN
 3  17438                Temporarily Online         1.0  United States

   country.abbrev  state.id  state.name state.abbrev state.keyword  city.id  \
 0             US       6.0  California           CA    california     10.0
 1             US      34.0    New York           NY      new-york   1507.0
 2            NaN       1.0      Online       Online        online      NaN
 3             US       NaN         NaN          NaN           NaN  31234.0

             city.name   city.keyword     school  school_id
 0         Los Angeles    los-angeles  codesmith      10643
 1                 NYC  new-york-city  codesmith      10643
 2                 NaN            NaN  codesmith      10643
 3  Temporarily Online    temp-online  codesmith      10643  ,
       id                 description  country.id   country.name  \
 0  15909  Chicago, IL, United States         1.0  United States
 1  16764                      Online         NaN            NaN

   country.abbrev  state.id state.name state.abbrev state.keyword  city.id  \
 0             US        15   Illinois           IL      illinois     39.0
 1            NaN         1     Online       Online        online      NaN

   city.name city.keyword        school  school_id
 0   Chicago      chicago  code-platoon      10627
 1       NaN          NaN  code-platoon      10627  ,
       id description  state.id state.name state.abbrev state.keyword  \
 0  15775      Online         1     Online       Online        online

          school  school_id
 0  knowledgehut      10846  ,
       id description  state.id state.name state.abbrev state.keyword   school  \
 0  15807      Online         1     Online       Online        online  udacity

    school_id
 0      11118  ,
       id description  state.id state.name state.abbrev state.keyword  \
 0  16297      Online         1     Online       Online        online

       school  school_id
 0  altcademy      10517  ,
       id                    description  country.id   country.name  \
 0  16035   Cleveland, OH, United States         1.0  United States
 1  16127    Columbus, OH, United States         1.0  United States
 2  16143  Cincinnati, OH, United States         1.0  United States
 3  16477  Pittsburgh, PA, United States         1.0  United States
 4  17272                         Online         NaN            NaN
 5  17722      Dallas, TX, United States         1.0  United States

   country.abbrev  state.id    state.name state.abbrev state.keyword  city.id  \
 0             US        37          Ohio           OH          ohio     71.0
 1             US        37          Ohio           OH          ohio     70.0
 2             US        37          Ohio           OH          ohio     72.0
 3             US        40  Pennsylvania           PA  pennsylvania     78.0
 4            NaN         1        Online       Online        online      NaN
 5             US        45         Texas           TX         texas     83.0

     city.name city.keyword         school  school_id
 0   Cleveland    cleveland  tech-elevator      11056
 1    Columbus     columbus  tech-elevator      11056
 2  Cincinnati   cincinnati  tech-elevator      11056
 3  Pittsburgh   pittsburgh  tech-elevator      11056
 4         NaN          NaN  tech-elevator      11056
 5      Dallas       dallas  tech-elevator      11056  ,
       id       description  country.id country.name country.abbrev  city.id  \
 0  16122  Barcelona, Spain        12.0        Spain             ES  31170.0
 1  17049            Online         NaN          NaN            NaN      NaN
 2  17122   Berlin, Germany        57.0      Germany             DE  31156.0
 3  17126   London, England        61.0      England             GB  31176.0

    city.name city.keyword  state.id state.name state.abbrev state.keyword  \
 0  Barcelona    barcelona       NaN        NaN          NaN           NaN
 1        NaN          NaN       1.0     Online       Online        online
 2     Berlin       berlin       NaN        NaN          NaN           NaN
 3     London       london       NaN        NaN          NaN           NaN

       school  school_id
 0  codeworks      10650
 1  codeworks      10650
 2  codeworks      10650
 3  codeworks      10650  ,
        id                 description  country.id   country.name  \
 0   16054    Miami, FL, United States         1.0  United States
 1   16758          Caracas, Venezuela        58.0      Venezuela
 2   17370               Madrid, Spain        12.0          Spain
 3   17805  Orlando, FL, United States         1.0  United States
 4   17806        San Jose, Costa Rica        18.0     Costa Rica
 5   17811         Montevideo, Uruguay        33.0        Uruguay
 6   18220            Barcelona, Spain        12.0          Spain
 7   18223                Milan, Italy        39.0          Italy
 8   18224                 Rome, Italy        39.0          Italy
 9   18225            Hamburg, Germany        57.0        Germany
 10  18226             Berlin, Germany        57.0        Germany
 11  18227             Dublin, Ireland        25.0        Ireland
 12  18228            Lisbon, Portugal        28.0       Portugal
 13  18229             Munich, Germany        57.0        Germany
 14  18231             Santiago, Chile        22.0          Chile
 15  18232            Bogota, Columbia        30.0       Colombia
 16  18233         Mexico City, Mexico        29.0         Mexico
 17  18234     Buenos Aires, Argentina        60.0      Argentina
 18  18236         Panama City, Panama         1.0  United States
 19  18237                  Lima, Peru       196.0           Peru
 20  18238              Quito, Ecuador       113.0        Ecuador
 21  18239             La Paz, Bolivia        83.0        Bolivia
 22  18241             Toronto, Canada         2.0         Canada
 23  18242               Malaga, Spain        12.0          Spain
 24  18370                      Online         NaN            NaN
 25  18371                 Atlanta, GA         1.0  United States
 26  18372                 Houston, TX         1.0  United States
 27  18373                 Chicago, IL         1.0  United States
 28  18374             Los Angeles, CA         1.0  United States
 29  18375                New York, NY         1.0  United States

    country.abbrev  state.id  state.name state.abbrev state.keyword  city.id  \
 0              US      11.0     Florida           FL       florida     31.0
 1              VE       NaN         NaN          NaN           NaN  31159.0
 2              ES       NaN         NaN          NaN           NaN  31052.0
 3              US      11.0     Florida           FL       florida     33.0
 4              CR       NaN         NaN          NaN           NaN  31236.0
 5              UY       NaN         NaN          NaN           NaN  31089.0
 6              ES       NaN         NaN          NaN           NaN  31170.0
 7              IT       NaN         NaN          NaN           NaN  31107.0
 8              IT       NaN         NaN          NaN           NaN  31180.0
 9              DE       NaN         NaN          NaN           NaN  31222.0
 10             DE       NaN         NaN          NaN           NaN  31156.0
 11             IE       NaN         NaN          NaN           NaN  31099.0
 12             PT       NaN         NaN          NaN           NaN  31075.0
 13             DE       NaN         NaN          NaN           NaN  31158.0
 14             CL       NaN         NaN          NaN           NaN  31067.0
 15             CO       NaN         NaN          NaN           NaN  31078.0
 16             MX       NaN         NaN          NaN           NaN  31175.0
 17             AR       NaN         NaN          NaN           NaN  31171.0
 18             US       NaN         NaN          NaN           NaN    806.0
 19             PE       NaN         NaN          NaN           NaN  31256.0
 20             EC       NaN         NaN          NaN           NaN  31235.0
 21             BO       NaN         NaN          NaN           NaN  31300.0
 22             CA       NaN         NaN          NaN           NaN  31152.0
 23             ES       NaN         NaN          NaN           NaN  31298.0
 24            NaN       1.0      Online       Online        online      NaN
 25             US      12.0     Georgia           GA       georgia     36.0
 26             US      45.0       Texas           TX         texas     81.0
 27             US      15.0    Illinois           IL      illinois     39.0
 28             US       6.0  California           CA    california     10.0
 29             US      34.0    New York           NY      new-york   3619.0

        city.name  city.keyword          school  school_id
 0          Miami         miami  4geeks-academy      10492
 1        Caracas       caracas  4geeks-academy      10492
 2         Madrid        madrid  4geeks-academy      10492
 3        Orlando       orlando  4geeks-academy      10492
 4       San Jose      san-jose  4geeks-academy      10492
 5     Montevideo    montevideo  4geeks-academy      10492
 6      Barcelona     barcelona  4geeks-academy      10492
 7          Milan         milan  4geeks-academy      10492
 8           Rome          rome  4geeks-academy      10492
 9        Hamburg       hamburg  4geeks-academy      10492
 10        Berlin        berlin  4geeks-academy      10492
 11        Dublin        dublin  4geeks-academy      10492
 12        Lisbon        lisbon  4geeks-academy      10492
 13        Munich        munich  4geeks-academy      10492
 14      Santiago      santiago  4geeks-academy      10492
 15        Bogota        bogota  4geeks-academy      10492
 16   Mexico City   mexico-city  4geeks-academy      10492
 17  Buenos Aires  buenos-aires  4geeks-academy      10492
 18   Panama City   panama-city  4geeks-academy      10492
 19          Lima          lima  4geeks-academy      10492
 20         Quito         quito  4geeks-academy      10492
 21        La Paz        la-paz  4geeks-academy      10492
 22       Toronto       toronto  4geeks-academy      10492
 23        Malaga  malaga-spain  4geeks-academy      10492
 24           NaN           NaN  4geeks-academy      10492
 25       Atlanta       atlanta  4geeks-academy      10492
 26       Houston       houston  4geeks-academy      10492
 27       Chicago       chicago  4geeks-academy      10492
 28   Los Angeles   los-angeles  4geeks-academy      10492
 29     New  York      new-york  4geeks-academy      10492  ,
       id                    description  country.id   country.name  \
 0  15875      Austin, TX, United States         1.0  United States
 1  15876      Dallas, TX, United States         1.0  United States
 2  16003     Chicago, IL, United States         1.0  United States
 3  16140      Boston, MA, United States         1.0  United States
 4  16436  Washington, DC, United States         1.0  United States
 5  16799                         Online         NaN            NaN

   country.abbrev  state.id            state.name state.abbrev  \
 0             US        45                 Texas           TX
 1             US        45                 Texas           TX
 2             US        15              Illinois           IL
 3             US        23         Massachusetts           MA
 4             US        10  District of Columbia           DC
 5            NaN         1                Online       Online

           state.keyword  city.id        city.name   city.keyword  \
 0                 texas     84.0           Austin         austin
 1                 texas     83.0           Dallas         dallas
 2              illinois     39.0          Chicago        chicago
 3         massachusetts     47.0           Boston         boston
 4  district-of-columbia    775.0  Washington D.C.  washington-dc
 5                online      NaN              NaN            NaN

           school  school_id
 0  coding-temple      10664
 1  coding-temple      10664
 2  coding-temple      10664
 3  coding-temple      10664
 4  coding-temple      10664
 5  coding-temple      10664  ,
       id                   description  country.id   country.name  \
 0  16089  Milwaukee, WI, United States         1.0  United States
 1  17420                        Online         NaN            NaN

   country.abbrev  state.id state.name state.abbrev state.keyword  city.id  \
 0             US        51  Wisconsin           WI     wisconsin     98.0
 1            NaN         1     Online       Online        online      NaN

    city.name city.keyword       school  school_id
 0  Milwaukee    milwaukee  devcodecamp      10703
 1        NaN          NaN  devcodecamp      10703  ,
        id                    description  state.id            state.name  \
 0   15709                         Online       1.0                Online
 1   16463     Seattle, WA, United States      49.0            Washington
 2   16730      Tacoma, WA, United States      49.0            Washington
 3   16731  Marysville, WA, United States      49.0            Washington
 4   16732     Spokane, WA, United States      49.0            Washington
 ..    ...                            ...       ...                   ...
 88  16903       Tulsa, OK, United States      38.0              Oklahoma
 89  16904  Tuscaloosa, AL, United States       2.0               Alabama
 90  16905  Washington, DC, United States      10.0  District of Columbia
 91  16906  Wilmington, DE, United States       9.0              Delaware
 92  16907          Wales, United Kingdom       NaN                   NaN

    state.abbrev         state.keyword  country.id    country.name  \
 0        Online                online         NaN             NaN
 1            WA            washington         1.0   United States
 2            WA            washington         1.0   United States
 3            WA            washington         1.0   United States
 4            WA            washington         1.0   United States
 ..          ...                   ...         ...             ...
 88           OK              oklahoma         1.0   United States
 89           AL               alabama         1.0   United States
 90           DC  district-of-columbia         1.0   United States
 91           DE              delaware         1.0   United States
 92          NaN                   NaN        11.0  United Kingdom

    country.abbrev  city.id        city.name   city.keyword  school  school_id
 0             NaN      NaN              NaN            NaN  nucamp      10923
 1              US     97.0          Seattle        seattle  nucamp      10923
 2              US   1196.0           Tacoma         tacoma  nucamp      10923
 3              US  30455.0       Marysville     marysville  nucamp      10923
 4              US   1195.0          Spokane        spokane  nucamp      10923
 ..            ...      ...              ...            ...     ...        ...
 88             US     75.0            Tulsa          tulsa  nucamp      10923

In [20]:
locations = pd.concat(locations_list)
locations.to_csv('locations.csv')
locations.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 195 entries, 0 to 7
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              195 non-null    int64
 1   description     195 non-null    object
 2   country.id      171 non-null    float64
 3   country.name    171 non-null    object
 4   country.abbrev  171 non-null    object
 5   city.id         171 non-null    float64
 6   city.name       171 non-null    object
 7   city.keyword    171 non-null    object
 8   state.id        158 non-null    float64
 9   state.name      158 non-null    object
 10  state.abbrev    158 non-null    object
 11  state.keyword   158 non-null    object
 12  school          195 non-null    object
 13  school_id       195 non-null    int64
dtypes: float64(3), int64(2), object(9)
memory usage: 22.9+ KB

In [21]:
courses = pd.concat(courses_list)
courses.to_csv('courses.csv')
courses.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 216 entries, 0 to 8
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   courses    216 non-null    object
 1   school     216 non-null    object
 2   school_id  216 non-null    int64
dtypes: int64(1), object(2)
memory usage: 6.8+ KB

In [22]:
badges = pd.concat(badges_list)
badges.to_csv('badges.csv')
badges.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 68 entries, 0 to 3
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   name         68 non-null     object
 1   keyword      68 non-null     object
 2   description  68 non-null     object
 3   school       68 non-null     object
 4   school_id    68 non-null     int64
dtypes: int64(1), object(4)
memory usage: 3.2+ KB

In [23]:
# any data cleaning still missing here? take a look at the description
schools = pd.concat(schools_list)
schools.to_csv('schools.csv')
schools.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24 entries, 0 to 0
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   website      24 non-null     object
 1   description  24 non-null     object
 2   LogoUrl      24 non-null     object
 3   school       24 non-null     object
 4   school_id    24 non-null     int64
dtypes: int64(1), object(4)
memory usage: 1.1+ KB